app/controllers/profiles_controller.rb

  def index
    @profile = Profile.first
---
SELECT  "profiles".* FROM "profiles" ORDER BY "profiles"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def edit
    if @profile.skills.empty?
---
SELECT  1 AS one FROM "skills" WHERE "skills"."profile_id" = ? LIMIT ?  [["profile_id", 1], ["LIMIT", 1]]
SELECT "skills".* FROM "skills" WHERE "skills"."profile_id" = ?  [["profile_id", 1]]

  def create
    @profile = Profile.new(profile_params)

    5.times do
      puts @profile.avatar_file_size
    end

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("name", "email", "github", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Fellipe"], ["email", "Callegas.f@gmail.com"], ["github", "Callegas"], ["bio", "Eu mesmo"], ["created_at", 2016-09-14 17:55:16 UTC], ["updated_at", 2016-09-14 17:55:16 UTC]]

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "name" = ?, "email" = ?, "github" = ?, "bio" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["name", "kenai"], ["email", "kenai@cachorro.com"], ["github", "kenai@github"], ["bio", "kenai cachorro"], ["updated_at", 2016-09-16 12:25:08 UTC], ["id", 1]]